app/Http/Controllers/User/DashboardController.php

select * from `user_wallets` where `user_id` = 1 limit 1
select * from `quick_recharges` where `key` = 'quick-recharge' limit 1
select count(*) as aggregate from `transactions` where `user_id` = 1 and `type` = 'MOBILE-TOPUP'
select count(*) as aggregate from `transactions` where `user_id` = 1 and `type` = 'GIFT-CARD'
select count(*) as aggregate from `transactions` where `user_id` = 1 and `type` = 'ADD-MONEY'
select count(*) as aggregate from `transactions` where `user_id` = 1 and `type` = 'BILL-PAY'
select count(*) as aggregate from `transactions` where `user_id` = 1 and `type` = 'DATA-BUNDLE'
---
    public function index()
    {
        $page_title     = "Dashboard";
        $user_wallet    = UserWallet::where('user_id', auth()->user()->id)->first();
        $section_slug   = Str::slug(SiteSectionConst::FOOTER_SECTION);
        $footer         = SiteSections::getData($section_slug)->first();
        $bttn_slug      = 'quick-recharge';
        $quick_bttns    = QuickRecharges::where('key', $bttn_slug)->first();
        $mobile_topup_count = Transaction::where('user_id', auth()->user()->id)->where('type', NotificationConst::MOBILE_TOPUP)->count();
        $giftcard_count = Transaction::where('user_id', auth()->user()->id)->where('type', NotificationConst::GIFTCARD)->count();
        $add_money_count = Transaction::where('user_id', auth()->user()->id)->where('type', NotificationConst::ADD_MONEY)->count();
        $utility_payment_count = Transaction::where('user_id', auth()->user()->id)->where('type', NotificationConst::BILL_PAY)->count();
        $data_bundle_count = Transaction::where('user_id', auth()->user()->id)->where('type', NotificationConst::DATA_BUNDLE)->count();

select * from `transactions` where `user_id` = 1 and `type` = 'ADD-MONEY' order by `created_at` desc limit 5 offset 0
select `id`, `name`, `alias`, `payment_gateway_id`, `currency_code`, `rate` from `payment_gateway_currencies` where `payment_gateway_currencies`.`id` in (33)
select count(*) as aggregate from `transactions` where `user_id` = 1 and `type` = 'ADD-MONEY'
---
    public function rechargeHistory()
    {
        $page_title = "Recharge History";
        $transactions = Transaction::where('user_id', auth()->user()->id)->with(
            'payment_gateway:name',
            'gateway_currency:id,name,alias,payment_gateway_id,currency_code,rate',
        )->AddMoney()->latest()->paginate(5);