app/Http/Controllers/User/DataBundleController.php

    public function buyBundle(Request $request)
    {
        try {
            $sender_wallet = UserWallet::where('user_id', auth()->id())->first();
---
select * from `user_wallets` where `user_id` = 1 limit 1