app/Http/Controllers/User/KycController.php

    public function index()
    {
        $basic_settings = BasicSettings::first();
---
select * from `basic_settings` limit 1

                    'kyc_verified'  => GlobalConst::APPROVED,
                ]);
            } else {
                $user->update([
                    'kyc_verified'  => GlobalConst::PENDING,
                ]);
---
update `users` set `kyc_verified` = 2, `users`.`updated_at` = '2025-07-12 17:28:38' where `id` = 1