app/Http/Controllers/User/RechargeController.php

select * from `payment_gateway_currencies` where `alias` = 'add-money-paystack-ngn-automatic' limit 1
---
    public function addMoneyPreview(Request $request)
    {
        $validated = Validator::make($request->all(), [
            'amount'                      => 'required|numeric|gt:0',
            'gateway_currency'            => 'required',
        ])->validate();
        $currency_details = PaymentGatewayCurrency::where('alias', $request->gateway_currency)->first();

select exists(select * from `transactions` where `callback_ref` = 'nX2DRBA3KV8lP46pUoc2vTxZhBQPC82Ogow46D2CsNo421cXSMbe63VGFEYO') as `exists`
select * from `temporary_datas` where `type` = 'ADD-MONEY' and `identifier` = 'nX2DRBA3KV8lP46pUoc2vTxZhBQPC82Ogow46D2CsNo421cXSMbe63VGFEYO' limit 1
---
    public function success(Request $request, $gateway)
    {
        try {
            $token = PaymentGatewayHelper::getToken($request->all(), $gateway);
            $temp_data = TemporaryData::where("type", PaymentGatewayConst::TYPEADDMONEY)->where("identifier", $token)->first();
            if (Transaction::where('callback_ref', $token)->exists()) {
                if (!$temp_data) return redirect()->route('user.dashboard')->with(['success' => [__('Transaction request sended successfully!')]]);;
            } else {
                if (!$temp_data) return redirect()->route('user.dashboard')->with(['error' => [__('Transaction failed. Record didn\'t saved properly. Please try again.')]]);