app/Http/Controllers/User/UtilityBillController.php

select * from `user_wallets` where `user_wallets`.`user_id` = 1 and `user_wallets`.`user_id` is not null limit 1
---
    public function payBill(Request $request)
    {
        try {
            $charges = json_decode($request->charges);

            $sender_wallet = UserWallet::where('user_id', auth()->id())->first();