app/Http/Helpers/helpers.php

select * from `useful_links`
---
function getLinks()
{
    return UsefulLink::all();