app/Http/Helpers/helpers.php

select * from `setup_pages` where `slug` = 'home' limit 1
---
function pageEnable($slug)
{
    $page = SetupPage::where('slug', $slug)->first();

select * from `useful_links`
---
function getLinks()
{
    return UsefulLink::all();