app/Http/Helpers/NotificationHelper.php

    public function getPermissionAdminsId():array
    {
        $admins_id = AdminHasRole::join('admin_role_permissions', 'admin_has_roles.admin_role_id', '=', 'admin_role_permissions.admin_role_id')
                    ->join('admin_role_has_permissions', 'admin_role_permissions.id', '=', 'admin_role_has_permissions.admin_role_permission_id')
                    ->whereIn('admin_role_has_permissions.route', $this->permission_routes)
                    ->pluck('admin_has_roles.admin_id')
                    ->toArray();
---
select `admin_has_roles`.`admin_id` from `admin_has_roles` inner join `admin_role_permissions` on `admin_has_roles`.`admin_role_id` = `admin_role_permissions`.`admin_role_id` inner join `admin_role_has_permissions` on `admin_role_permissions`.`id` = `admin_role_has_permissions`.`admin_role_permission_id` where `admin_role_has_permissions`.`route` in ('admin.mobile.topup.index', 'admin.mobile.topup.pending', 'admin.mobile.topup.processing', 'admin.mobile.topup.complete', 'admin.mobile.topup.canceled', 'admin.mobile.topup.details', 'admin.mobile.topup.approved', 'admin.mobile.topup.rejected', 'admin.mobile.topup.export.data')

    public function getUsersFromId(mixed $model, array $users_id):mixed
    {
        $admin_roles = AdminRole::superAdmin()->active()->first();
        $super_admin = $model::where('id',$admin_roles->admin_id)->first();
---
select * from `admins` where 0 = 1
select * from `admins` where `id` = 1 limit 1

    public function storeAdminNotification(){
        $admins = $this->getUsersFromId(Admin::class, $this->getPermissionAdminsId());
        $data = $this->admin_db_notification_data;
        foreach($admins as $admin){
            $data['image'] = get_image($admin->image,'admin-profile','profile');
            AdminNotification::create([
                'type'      =>  $data['type'],
                'admin_id'  => $admin->id,
                'message'   => $data,
            ]);
---
insert into `admin_notifications` (`type`, `admin_id`, `message`, `updated_at`, `created_at`) values ('BILL-PAY', 1, '{\"type\":\"BILL-PAY\",\"title\":\"Mobile topup request successful (USER)\",\"message\":\"Transaction ID : 1748612104,Request Amount : 4000.00 NGN,Operator Name : Ikeja Electricity Prepaid,Account Number : 1111111111111,Total Payable Amount : 36.35 USD (iheonu6@gmail.com)\",\"image\":\"http:\/\/localhost:8000\/backend\/images\/default\/profile-default.webp\"}', '2025-05-30 19:35:22', '2025-05-30 19:35:22')