app/Http/Helpers/PaymentGateway.php

select * from `payment_gateway_currencies` where `alias` = 'add-money-paystack-ngn-automatic' limit 1
select * from `exchange_rates` where `currency_code` = 'NGN' limit 1
---
    public function gateway()
    {
        $request_data = $this->request_data;
        if (empty($request_data)) throw new Exception("Gateway Information is not available. Please provide payment gateway currency alias");
        $validated = $this->validator($request_data)->validate();
        $gateway_currency = PaymentGatewayCurrency::where("alias", $validated[$this->currency_input_name])->first();

        $exchange_rate = ExchangeRate::where("currency_code", $gateway_currency->currency_code)->first();

select * from `payment_gateway_currencies` where `payment_gateway_currencies`.`id` = 33 limit 1
---
    public function authenticateTempData()
    {
        $tempData = $this->request_data;
        if (empty($tempData) || empty($tempData['type'])) throw new Exception('Transaction failed. Record didn\'t saved properly. Please try again.');

        if ($this->requestIsApiUser()) {
            $creator_table = $tempData['data']->creator_table ?? null;
            $creator_id = $tempData['data']->creator_id ?? null;
            $creator_guard = $tempData['data']->creator_guard ?? null;

            $api_authenticated_guards = PaymentGatewayConst::apiAuthenticateGuard();
            if (!array_key_exists($creator_guard, $api_authenticated_guards)) throw new Exception('Request user doesn\'t save properly. Please try again');

            if ($creator_table == null || $creator_id == null || $creator_guard == null) throw new Exception('Request user doesn\'t save properly. Please try again');
            $creator = DB::table($creator_table)->where("id", $creator_id)->first();
            if (!$creator) throw new Exception("Request user doesn\'t save properly. Please try again");

            $api_user_login_guard = $api_authenticated_guards[$creator_guard];
            $this->output['api_login_guard'] = $api_user_login_guard;
            Auth::guard($api_user_login_guard)->loginUsingId($creator->id);
        }

        $currency_id = $tempData['data']->currency ?? "";
        $gateway_currency = PaymentGatewayCurrency::find($currency_id);

select * from `basic_settings` limit 1
---
                }
            }
            try {
                $basic_setting = BasicSettings::first();

update `user_wallets` set `balance` = 100267.06, `user_wallets`.`updated_at` = '2025-08-19 20:11:46' where `id` = 1
---
    public function updateWalletBalance($output)
    {
        $update_amount = $output['wallet']->balance + $output['amount']->requested_amount;

        $output['wallet']->update([
            'balance'   => $update_amount,
        ]);

insert into `transaction_charges` (`transaction_id`, `percent_charge`, `fixed_charge`, `total_charge`, `created_at`) values (56, 0.6, 0.0012457954403887, 0.60124579544039, '2025-08-19 20:11:49')
---
    public function insertCharges($output, $id)
    {
        DB::beginTransaction();
        try {
            DB::table('transaction_charges')->insert([
                'transaction_id'    => $id,
                'percent_charge'    => $output['amount']->percent_charge / $output['amount']->exchange_rate,
                'fixed_charge'      => $output['amount']->fixed_charge / $output['amount']->exchange_rate,
                'total_charge'      => $output['amount']->total_charge / $output['amount']->exchange_rate,
                'created_at'        => now(),
            ]);

insert into `transaction_devices` (`transaction_id`, `ip`, `mac`, `city`, `country`, `longitude`, `latitude`, `timezone`, `browser`, `os`) values (56, '127.0.0.1', '', 'New Haven', 'United States', -72.92, 41.31, 'America/New_York', 'Chrome', 'OS X')
---
    public function insertDevice($output, $id)
    {
        $client_ip = request()->ip() ?? false;
        $location = geoip()->getLocation($client_ip);
        $agent = new Agent();

        // $mac = exec('getmac');
        // $mac = explode(" ",$mac);
        // $mac = array_shift($mac);
        $mac = "";

        DB::beginTransaction();
        try {
            DB::table("transaction_devices")->insert([
                'transaction_id' => $id,
                'ip'            => $client_ip,
                'mac'           => $mac,
                'city'          => $location['city'] ?? "",
                'country'       => $location['country'] ?? "",
                'longitude'     => $location['lon'] ?? "",
                'latitude'      => $location['lat'] ?? "",
                'timezone'      => $location['timezone'] ?? "",
                'browser'       => $agent->browser() ?? "",
                'os'            => $agent->platform() ?? "",
            ]);

delete from `temporary_datas` where `id` = 84
select * from `temporary_datas` where `temporary_datas`.`id` = 84 limit 1
---
    public function removeTempData($output)
    {
        try {
            $id = $output['tempData']['id'];
            TemporaryData::find($id)->delete();