app/Http/Helpers/Reloadly.php

select * from `exchange_rates` where `currency_code` = 'NGN' limit 1
select * from `exchange_rates` where `currency_code` = 'BDT' limit 1
---
        $user_wallet        = auth()->user()->wallets; // GBP
        $wallet_currency    = $user_wallet->currency;

        $receiver_currency  = ExchangeRate::where('currency_code', $local_currency)->first(); // XOF
        $merchant_currency  = ExchangeRate::where('currency_code', $operator['senderCurrencyCode'])->first(); // BDT

select * from `transaction_settings` where `slug` = 'mobile_topup' limit 1
---

        $exchange_rate                      = $default_currency_exchange_amount * $wallet_currency->rate; // 1 USD = ? GBP, that means 1 XOF = ? GBP (wallet currency)

        $transaction_charges    = TransactionSetting::where('slug', 'mobile_topup')->first();

select * from `exchange_rates` where `currency_code` = 'NGN' limit 1
select * from `exchange_rates` where `currency_code` = 'BDT' limit 1
---
    public function getUtilityBillCharge(array $request_data)
    {
        $vaildate = Validator::make($request_data, [
            'biller_id' => 'required|string',
            'amount'   => 'required',
            'account_number' => 'required|string',
        ]);

        if ($vaildate->fails()) {
            throw ValidationException::withMessages($vaildate->errors()->all());
        }

        $request_data['referenceId'] = generate_unique_string('transactions', 'trx_id', 16);

        $utility_bill = $this->getUtilityBill($request_data['biller_id']);

        $currency_code = $utility_bill['localTransactionCurrencyCode'] ?? "USD";

        $receiver_currency  = ExchangeRate::where('currency_code', $currency_code)->first(); // XOF
        $merchant_currency  = ExchangeRate::where('currency_code', $utility_bill['internationalTransactionCurrencyCode'])->first(); // BDT

select * from `transaction_settings` where `slug` = 'utility_bill' limit 1
---
        $user_wallet        = auth()->user()->wallets; // GBP
        $wallet_currency    = $user_wallet->currency;

        $transaction_charges    = TransactionSetting::where('slug', 'utility_bill')->first();