app/Http/Helpers/VTPass.php

    public function __construct()
    {
        $this->provider = VTPassApi::mobileTopUp()->first();
---
select * from `vtpass_apis` where `type` = 'MOBILE-TOPUP' limit 1

    public function getCharges(array $data): array
    {
        $local_currency     = "NGN";
        $merchant_currency  = "NGN";

        $request_amount     = $amount = $data['amount'] ?? 0; // $amount is local amount

        $user_wallet        = auth()->user()->wallets; // GBP
        $wallet_currency    = $user_wallet->currency;

        $receiver_currency  = ExchangeRate::where('currency_code', $local_currency)->first();
        $merchant_currency  = ExchangeRate::where('currency_code', $merchant_currency)->first();
        $default_currency   = Currency::default(); // USD

        $merchant_pay_amount        = $request_amount;
        $default_currency_amount    = $merchant_pay_amount / $merchant_currency->rate;

        $exchange_wallet_amount     = $default_currency_amount * $default_currency->rate;

        // exchange rate
        $receiver_currency_exchange_rate    = $receiver_currency->rate;
        $default_currency_exchange_amount   = $merchant_pay_amount / $receiver_currency->rate;

        $exchange_rate                      = 1 / $merchant_currency->rate;

        $transaction_charges    = TransactionSetting::where('slug', 'mobile_topup')->first();
---
select * from `exchange_rates` where `currency_code` = 'NGN' limit 1
select * from `transaction_settings` where `slug` = 'mobile_topup' limit 1