app/Http/Controllers/Api/V1/User/Auth/ForgotPasswordController.php

select * from `user_password_resets` where `token` = 'vYV9V899o7rXX9JaDzTuxp4xZO2TAoxAo4NyqSxAyQjQVlE8vNvF5DxCpjCFw7MFZhzfWq3YHNE4mxvV' limit 1
update `users` set `password` = '$2y$10$aqnf/d46Mrgph5uRgtZlduzN8iRo2gjx7gLWd6IFd2Bpdz6W/ufNq', `users`.`updated_at` = '2025-07-05 17:07:34' where `id` = 1
delete from `user_password_resets` where `id` = 2
---
    public function resetPassword(Request $request)
    {

        $basic_settings = BasicSettingsProvider::get();
        $password_rule = "required|string|min:6|confirmed";
        if ($basic_settings->secure_password) {
            $password_rule = ["required", Password::min(8)->letters()->mixedCase()->numbers()->symbols()->uncompromised(), "confirmed"];
        }

        $validator = Validator::make($request->all(), [
            'token'         => "required|string|exists:user_password_resets,token",
            'password'      => $password_rule,
        ]);

        if ($validator->fails()) {
            return Response::error($validator->errors()->all(), []);
        }
        $validated = $validator->validate();

        $password_reset = UserPasswordReset::where("token", $validated['token'])->first();
        if (!$password_reset) return Response::error([__('Request token is invalid')], [], 400);

        try {
            $password_reset->user->update([
                'password'      => Hash::make($validated['password']),
            ]);
            $password_reset->delete();