app/Http/Controllers/Api/V1/User/Auth/LoginController.php

                // User authenticated
                $token = $user->createToken("auth_token");

                DB::table('oauth_access_tokens')
                    ->where('id', $token->token->id)
                    ->update(['expires_at' => now()->addMinutes(1)->toDateTimeString()]);
---
update `oauth_access_tokens` set `expires_at` = '2025-08-19 16:40:56' where `id` = 'ae601c43b4b17384642d883600f1d82bb65bda682a9c63859dd055914a75dbf4ed5474a7ae59a4b4'