app/Http/Controllers/Api/V1/User/MobileTopupController.php

                "data" => null
            ], 500);
        }
        $sender_wallet = UserWallet::where('user_id', $user->id)->first();
---
select * from `user_wallets` where `user_id` = 1 limit 1

                'data' => null
            ], 404);
        }
        $topupCharge = TransactionSetting::where('slug', 'mobile_topup')->where('status', 1)->first();
---
select * from `transaction_settings` where `slug` = 'mobile_topup' and `status` = 1 limit 1

    public function topupChargeAutomatic($sender_amount, $operator, $sender_wallet, $charges)
    {

        $destinationCurrency = ExchangeRate::where(['currency_code' => $operator['destinationCurrencyCode']])->first();
---
select * from `exchange_rates` where (`currency_code` = 'NGN') limit 1