app/Http/Controllers/Api/V1/User/ProfileController.php

    public function profileInfoUpdate(Request $request)
    {
        $validator = Validator::make($request->all(), [
            'firstname'     => "required|string|max:60",
            'lastname'      => "required|string|max:60",
            'country'       => "required|string|max:50",
            'mobile_code'   => "required|string|max:20",
            'email'         => "required|email",
            'mobile'        => "required|string|max:20",
            'address'       => "nullable|string|max:250",
            'image'         => "nullable|image|mimes:jpg,png,svg,webp|max:10240",
        ]);

        if ($validator->fails()) return Response::error($validator->errors()->all(), []);

        $validated = $validator->validate();
        $validated['mobile']        = get_only_numeric_data($validated['mobile']);
        $validated['mobile_code']   = get_only_numeric_data($validated['mobile_code']);
        $complete_phone             = $validated['mobile_code'] . $validated['mobile'];
        $validated['full_mobile']   = $complete_phone;

        $user = auth()->guard(get_auth_guard())->user();

        if (User::whereNot('id', $user->id)->where("full_mobile", $validated['full_mobile'])->exists()) {
---
select exists(select * from `users` where not `id` = 1 and `full_mobile` = '23412345678998') as `exists`

            $validated['image']     = $upload_image;
        }
        try {
            $user->update($validated);
---
update `users` set `firstname` = 'John', `lastname` = 'Doe', `mobile` = '12345678998', `full_mobile` = '23412345678998', `users`.`updated_at` = '2025-07-13 19:46:01' where `id` = 1