app/Http/Controllers/Api/V1/User/UtilityBillController.php

    public function insertAutomaticCharges($id, $charges, $sender_wallet, $account_number, $trx_id)
    {
        DB::beginTransaction();
        try {
            DB::table('transaction_charges')->insert([
                'transaction_id'    =>  $id,
                'percent_charge'    =>  $charges->percent_charge_calc,
                'fixed_charge'       =>  $charges->fixed_charge,
                'total_charge'      =>  $charges->total_charge_calc,
                'created_at'        =>  now(),
            ]);
            DB::commit();

            //notification
            $notification_content = [
                'title'         => __("Utility Bill"),
                'message'       => __('Utility Payment request successful') . " " . $charges->amount . ' ' . $charges->currency_code,
                'image'         => get_image($sender_wallet->user->image, 'user-profile'),
            ];

            //user Notification
            UserNotification::create([
                'type'      =>  $charges->type,
                'user_id'   =>  $sender_wallet->user->id,
                'message'   =>  $notification_content,
            ]);
---
insert into `transaction_charges` (`transaction_id`, `percent_charge`, `fixed_charge`, `total_charge`, `created_at`) values (32, '0.00', '0.00', '0.00', '2025-05-30 19:35:19')
insert into `user_notifications` (`type`, `user_id`, `message`, `updated_at`, `created_at`) values ('ELECTRICITY_BILL_PAYMENT', 1, '{\"title\":\"Utility Bill\",\"message\":\"Utility Payment request successful 4000.00 NGN\",\"image\":\"http:\/\/localhost:8000\/backend\/images\/default\/default.webp\"}', '2025-05-30 19:35:19', '2025-05-30 19:35:19')

    public function updateSenderWalletBalance($authWallet, $afterCharge)
    {
        $authWallet->update([
            'balance'   => $afterCharge,
        ]);
---
update `user_wallets` set `balance` = -106.85472155, `user_wallets`.`updated_at` = '2025-05-30 19:35:19' where `id` = 1