app/Traits/PaymentGateway/Paystack.php

delete from `temporary_datas` where `id` = 27
---
    public function createPaystackPaymentLink($output, $request_credentials)
    {
        $endpoint = $this->registerPaystackEndpoints('create-payment-link');

        $temp_record_token = generate_unique_string('temporary_datas', 'identifier', 60);
        $this->setUrlParams("token=" . $temp_record_token); // set Parameter to URL for identifying when return success/cancel

        $redirection = $this->getRedirection();
        $url_parameter = $this->getUrlParams();

        $user = auth()->guard(get_auth_guard())->user();

        $temp_data = $this->paystackJunkInsert($temp_record_token); // create temporary information

        $response = Http::withHeaders([
            'Authorization' => 'Bearer ' . $request_credentials->token,
            'Content-Type'  => 'application/json',
        ])->post($endpoint, [
            "email"         => $user->email,
            "amount"        => get_amount($output['amount']->total_amount, null, 2) * 100, // as per paystack policy,
            "currency"      => $output['currency']->currency_code,
            "callback_url"  => $this->setGatewayRoute($redirection['return_url'], PaymentGatewayConst::PAYSTACK, $url_parameter),
            "reference"     => $temp_record_token,
        ])->throw(function (Response $response, RequestException $exception) use ($temp_data) {
            $temp_data->delete();
            throw new Exception($exception->getMessage());
        })->json();