app/Http/Controllers/User/Auth/RegisterController.php

select * from `site_sections` where `key` = 'auth-section' limit 1
---
    public function showRegistrationForm()
    {
        $client_ip = request()->ip() ?? false;
        $user_country = geoip()->getLocation($client_ip)['country'] ?? "";
        $register_des = SiteSections::where('key', 'auth-section')->first();