app/Models/Admin/SiteSections.php

    public function scopeSiteCookie() {
       return $this->where('key','site_cookie')->first();
---
select * from `site_sections` where `key` = 'site_cookie' limit 1