app/Http/Controllers/GlobalController.php

    public function receiverWallet(Request $request)
    {
        $receiver_currency = ExchangeRate::where(['currency_code' => $request->code])->first();
---
select * from `exchange_rates` where (`currency_code` = 'USD') limit 1