app/Http/Controllers/Admin/ApiSettingsController.php

    public function generateKeys()
    {
        $api_key = null;
        $secret_key = null;

        $unique_api_key = false;
        while (!$unique_api_key) {
            $api_key = Str::random(32);
            $exists = ApiClient::where('api_key', $api_key)->first();
            if (!$exists) {
                $unique_api_key = true;
            }
        }

        $unique_secret_key = false;
        while (!$unique_secret_key) {
            $secret_key = "SK_" . Str::random(64);
            $exists = ApiClient::where('secret_key', $secret_key)->first();
            if (!$exists) {
                $unique_secret_key = true;
            }
        }

        $api_client = ApiClient::where('user_id', auth()->id())->first();
        if ($api_client) {
            $api_client->api_key = $api_key;
            $api_client->secret_key = $secret_key;
            $api_client->save();
---
select * from `api_clients` where `api_key` = 'WXYNSYxmnH5yJ45MKxMtRWOEQ6tGlcaO' limit 1
select * from `api_clients` where `secret_key` = 'SK_m7HgYVUq5K1KK2wjc9vmsBpezpfMtgWJ7Z3KHIjwgystD2lQW7ucV4C80NsWcqoU' limit 1
select * from `api_clients` where `user_id` = 1 limit 1
update `api_clients` set `api_key` = 'WXYNSYxmnH5yJ45MKxMtRWOEQ6tGlcaO', `secret_key` = 'SK_m7HgYVUq5K1KK2wjc9vmsBpezpfMtgWJ7Z3KHIjwgystD2lQW7ucV4C80NsWcqoU', `api_clients`.`updated_at` = '2025-05-30 02:17:21' where `id` = 7