app/Http/Controllers/Admin/AppOnboardScreensController.php

    public function onboardScreens() {
        $page_title = __("Onboard Screen");
        $onboard_screens = AppOnboardScreens::orderByDesc('id')->get();
---
select * from `app_onboard_screens` order by `id` desc