app/Http/Controllers/Admin/DashboardController.php

select * from `transactions` where `type` = 'ADD-MONEY' order by `created_at` desc limit 5
select sum(`request_amount`) as aggregate from `transactions` where `type` = 'ADD-MONEY'
select sum(`request_amount`) as aggregate from `transactions` where `type` = 'ADD-MONEY' and `created_at` between '2025-06-01 00:00:00' and '2025-06-14 23:59:59' and `status` = 1
select sum(`request_amount`) as aggregate from `transactions` where `status` = 2 and `type` = 'ADD-MONEY' and `created_at` between '2025-06-01 00:00:00' and '2025-06-14 23:59:59'
---
    public function index()
    {
        $page_title = __("Dashboard");

        $last_month_start = Carbon::now()->subMonth()->startOfMonth()->startOfDay();
        $last_month_end = Carbon::now()->subMonth()->endOfMonth()->endOfDay();
        $this_month_start = Carbon::now()->startOfMonth()->startOfDay();
        $this_month_end = Carbon::now()->endOfDay();

        $this_week = Carbon::now()->subWeek()->toDateString();
        $this_month = Carbon::now()->subMonth()->toDateString();
        $this_year = Carbon::now()->subYear()->toDateString();
        $transactions = Transaction::where('type', PaymentGatewayConst::TYPEADDMONEY)->latest()->take(5)->get();


        // Recharge Money
        $recharge_money_total_balance = Transaction::toBase()->where('type', PaymentGatewayConst::TYPEADDMONEY)->sum('request_amount');
        $completed_recharge_money =  Transaction::toBase()
            ->where('type', PaymentGatewayConst::TYPEADDMONEY)
            ->whereBetween('created_at', [$this_month_start, $this_month_end])
            ->where('status', 1)
            ->sum('request_amount');
        $pending_recharge_money =  Transaction::toBase()
            ->where('status', 2)
            ->where('type', PaymentGatewayConst::TYPEADDMONEY)
            ->whereBetween('created_at', [$this_month_start, $this_month_end])
            ->sum('request_amount');

select sum(`request_amount`) as aggregate from `transactions` where `type` = 'GIFT-CARD'
select sum(`request_amount`) as aggregate from `transactions` where `type` = 'GIFT-CARD' and `created_at` between '2025-06-01 00:00:00' and '2025-06-14 23:59:59' and `status` = 1
select sum(`request_amount`) as aggregate from `transactions` where `status` = 2 and `type` = 'GIFT-CARD' and `created_at` between '2025-05-01 00:00:00' and '2025-05-31 23:59:59'
---
        }

        // gift card
        $total_gift_card = Transaction::toBase()->where('type', PaymentGatewayConst::GIFTCARD)->sum('request_amount');
        $gift_card_this_month =  Transaction::toBase()
            ->where('type', PaymentGatewayConst::GIFTCARD)
            ->whereBetween('created_at', [$this_month_start, $this_month_end])
            ->where('status', 1)
            ->sum('request_amount');
        $gift_card_last_month =  Transaction::toBase()
            ->where('status', 2)
            ->where('type', PaymentGatewayConst::GIFTCARD)
            ->whereBetween('created_at', [$last_month_start, $last_month_end])
            ->sum('request_amount');

select sum(`request_amount`) as aggregate from `transactions` where `type` = 'MOBILE-TOPUP'
select sum(`request_amount`) as aggregate from `transactions` where `type` = 'MOBILE-TOPUP' and `created_at` between '2025-06-01 00:00:00' and '2025-06-14 23:59:59' and `status` = 1
select sum(`request_amount`) as aggregate from `transactions` where `status` = 2 and `created_at` between '2025-05-01 00:00:00' and '2025-05-31 23:59:59' and `type` = 'MOBILE-TOPUP'
---
        }

        // mobile topup
        $total_mobile_topup = Transaction::toBase()->where('type', PaymentGatewayConst::MOBILETOPUP)->sum('request_amount');
        $mobile_topup_this_month =  Transaction::toBase()
            ->where('type', PaymentGatewayConst::MOBILETOPUP)
            ->whereBetween('created_at', [$this_month_start, $this_month_end])
            ->where('status', 1)
            ->sum('request_amount');
        $mobile_topup_last_month =  Transaction::toBase()
            ->where('status', 2)
            ->whereBetween('created_at', [$last_month_start, $last_month_end])
            ->where('type', PaymentGatewayConst::MOBILETOPUP)
            ->sum('request_amount');

select sum(`total_charge`) as aggregate from `transaction_charges`
select sum(`total_charge`) as aggregate from `transaction_charges` where `created_at` between '2025-06-01 00:00:00' and '2025-06-14 23:59:59'
select sum(`total_charge`) as aggregate from `transaction_charges` where `created_at` between '2025-05-01 00:00:00' and '2025-05-31 23:59:59'
---
        }

        //total profits
        $total_profits = TransactionCharge::toBase()->sum('total_charge');

        $this_month_profits = TransactionCharge::toBase()
            ->whereBetween('created_at', [$this_month_start, $this_month_end])
            ->sum('total_charge');

        $last_month_profits = TransactionCharge::toBase()
            ->whereBetween('created_at', [$last_month_start, $last_month_end])
            ->sum('total_charge');

select count(*) as aggregate from `users`
---
        }

        //Users
        $total_users = User::toBase()->count();

select count(*) as aggregate from `user_support_tickets`
---
        }

        //Support tickets
        $total_tickets = UserSupportTicket::toBase()->count();

select count(*) as aggregate from `transactions` where `type` = 'ADD-MONEY' and date(`created_at`) = '2025-06-01' and `status` = 2
select count(*) as aggregate from `transactions` where `type` = 'ADD-MONEY' and date(`created_at`) = '2025-06-01' and `status` = 1
select count(*) as aggregate from `transactions` where `type` = 'ADD-MONEY' and date(`created_at`) = '2025-06-01' and `status` = 4
select count(*) as aggregate from `transactions` where `type` = 'ADD-MONEY' and date(`created_at`) = '2025-06-01' and `status` = 3
---
            $start_date = $start->format('Y-m-d');

            // Monthly add money
            $pending = Transaction::where('type', PaymentGatewayConst::TYPEADDMONEY)
                ->whereDate('created_at', $start_date)
                ->where('status', 2)
                ->count();
            $success = Transaction::where('type', PaymentGatewayConst::TYPEADDMONEY)
                ->whereDate('created_at', $start_date)
                ->where('status', 1)
                ->count();
            $canceled = Transaction::where('type', PaymentGatewayConst::TYPEADDMONEY)
                ->whereDate('created_at', $start_date)
                ->where('status', 4)
                ->count();
            $hold = Transaction::where('type', PaymentGatewayConst::TYPEADDMONEY)
                ->whereDate('created_at', $start_date)
                ->where('status', 3)
                ->count();

select count(*) as aggregate from `transactions` where `type` = 'GIFT-CARD' and date(`created_at`) = '2025-06-01' and `status` = 2
select count(*) as aggregate from `transactions` where `type` = 'GIFT-CARD' and date(`created_at`) = '2025-06-01' and `status` = 1
select count(*) as aggregate from `transactions` where `type` = 'GIFT-CARD' and date(`created_at`) = '2025-06-01' and `status` = 4
select count(*) as aggregate from `transactions` where `type` = 'GIFT-CARD' and date(`created_at`) = '2025-06-01' and `status` = 3
---
            $hold_data[]     = $hold;

            // Monthly Giftcard
            $giftcard_pending = Transaction::where('type', PaymentGatewayConst::GIFTCARD)
                ->whereDate('created_at', $start_date)
                ->where('status', 2)
                ->count();
            $giftcard_success = Transaction::where('type', PaymentGatewayConst::GIFTCARD)
                ->whereDate('created_at', $start_date)
                ->where('status', 1)
                ->count();
            $giftcard_canceled = Transaction::where('type', PaymentGatewayConst::GIFTCARD)
                ->whereDate('created_at', $start_date)
                ->where('status', 4)
                ->count();
            $giftcard_hold = Transaction::where('type', PaymentGatewayConst::GIFTCARD)
                ->whereDate('created_at', $start_date)
                ->where('status', 3)
                ->count();

select count(*) as aggregate from `transactions` where `type` = 'MOBILE-TOPUP' and date(`created_at`) = '2025-06-01' and `status` = 2
select count(*) as aggregate from `transactions` where `type` = 'MOBILE-TOPUP' and date(`created_at`) = '2025-06-01' and `status` = 1
select count(*) as aggregate from `transactions` where `type` = 'MOBILE-TOPUP' and date(`created_at`) = '2025-06-01' and `status` = 4
select count(*) as aggregate from `transactions` where `type` = 'MOBILE-TOPUP' and date(`created_at`) = '2025-06-01' and `status` = 3
---
            $giftcard_hold_data[]     = $giftcard_hold;

            //Monthley mobile topup
            $topup_pending = Transaction::where('type', PaymentGatewayConst::MOBILETOPUP)
                ->whereDate('created_at', $start_date)
                ->where('status', 2)
                ->count();
            $topup_success = Transaction::where('type', PaymentGatewayConst::MOBILETOPUP)
                ->whereDate('created_at', $start_date)
                ->where('status', 1)
                ->count();
            $topup_canceled = Transaction::where('type', PaymentGatewayConst::MOBILETOPUP)
                ->whereDate('created_at', $start_date)
                ->where('status', 4)
                ->count();
            $topup_hold = Transaction::where('type', PaymentGatewayConst::MOBILETOPUP)
                ->whereDate('created_at', $start_date)
                ->where('status', 3)
                ->count();