app/Http/Controllers/Admin/SetupKycController.php

    public function index()
    {
        $page_title = __("Setup KYC");
        $kycs = SetupKyc::orderByDesc('id')->get();
---
select * from `setup_kycs` order by `id` desc