app/Http/Controllers/Admin/TrxSettingsController.php

select * from `transaction_settings`
---
    public function index()
    {
        $page_title = __("Fees & Charges");
        $transaction_charges = TransactionSetting::all();