app/Http/Controllers/Admin/UserCareController.php

    public function userDetails($username)
    {
        $page_title = __("User Details");
        $user = User::where('username', $username)->with(
            'wallets:id,user_id,balance'
        )->first();

        $transactions = Transaction::where('user_id',$user->id);
        $userTicket = UserSupportTicket::where('user_id',$user->id);

        $transactionsAll = $transactions->count();
---
select * from `users` where `username` = 'daniel' limit 1
select `id`, `user_id`, `balance` from `user_wallets` where `user_wallets`.`user_id` in (1)
select count(*) as aggregate from `transactions` where `user_id` = 1